performance/reports/spike-test/statistics.json
{
  "Phase 1 - Baseline (50 users)": {
    "note": "t=0s to t=60s | 50 threads | normal traffic",
    "sampleCount": 6000,
    "errorCount": 12,
    "errorPct": 0.2,
    "meanResTime": 243.1,
    "medianResTime": 198.0,
    "minResTime": 102.0,
    "maxResTime": 1124.0,
    "pct1ResTime": 143.0,
    "pct2ResTime": 487.0,
    "pct3ResTime": 876.0,
    "throughput": 50.1,
    "receivedKBytesPerSec": 389.4,
    "sentKBytesPerSec": 11.2
  },
  "Phase 2 - Spike Peak (+450 users injected at t=60s)": {
    "note": "t=60s to t=185s | 500 threads | sudden spike",
    "sampleCount": 37500,
    "errorCount": 4687,
    "errorPct": 12.5,
    "meanResTime": 3842.7,
    "medianResTime": 2987.0,
    "minResTime": 198.0,
    "maxResTime": 10000.0,
    "pct1ResTime": 1243.0,
    "pct2ResTime": 6871.0,
    "pct3ResTime": 9432.0,
    "throughput": 312.4,
    "receivedKBytesPerSec": 2431.8,
    "sentKBytesPerSec": 87.6
  },
  "Phase 3 - Recovery (back to 50 users at t=185s)": {
    "note": "t=185s to t=240s | 50 threads | recovery observation",
    "sampleCount": 3300,
    "errorCount": 47,
    "errorPct": 1.42,
    "meanResTime": 612.4,
    "medianResTime": 498.0,
    "minResTime": 128.0,
    "maxResTime": 3241.0,
    "pct1ResTime": 287.0,
    "pct2ResTime": 1124.0,
    "pct3ResTime": 2187.0,
    "throughput": 55.1,
    "receivedKBytesPerSec": 428.7,
    "sentKBytesPerSec": 12.4
  },
  "Total": {
    "transaction": "Total",
    "sampleCount": 46800,
    "errorCount": 4746,
    "errorPct": 10.14,
    "meanResTime": 2312.4,
    "medianResTime": 1124.0,
    "minResTime": 102.0,
    "maxResTime": 10000.0,
    "pct1ResTime": 312.0,
    "pct2ResTime": 4871.0,
    "pct3ResTime": 8743.0,
    "throughput": 194.8,
    "receivedKBytesPerSec": 1516.8,
    "sentKBytesPerSec": 45.0
  }
}